ChoicesPostLevel = [
    ('رئیس', 'رئیس'),
    ('معاون و مدیرکل مستقل', 'معاون و مدیرکل مستقل'),
    ('مدیرکل تابعه', 'مدیرکل تابعه'),
    ('معاون مدیرکل', 'معاون مدیرکل'),
    ('مدیر', 'مدیر'),
    ('مشاور', 'مشاور'),
    ('کارشناس', 'کارشناس'),
    ('مسئول دفتر', 'مسئول دفتر'),
    ('کاردان', 'کاردان'),
    ('تأسیسات', 'تأسیسات'),
    ('خدمات', 'خدمات'),
    ('راننده', 'راننده'),
    ('حفاظت فیزیکی', 'حفاظت فیزیکی'),
]
ChoicesPostPosition = [
    ('آفاق 1', 'آفاق 1'),
    ('آفاق 3', 'آفاق 3'),
    ('آفاق 4', 'آفاق 4'),
    ('آفاق 6', 'آفاق 6'),
    ('آفاق 12', 'آفاق 12'),
    ('آفاق 13', 'آفاق 13'),
    ('آفاق 14', 'آفاق 14'),
    ('آفاق 15', 'آفاق 15'),
    ('آفاق 16', 'آفاق 16'),
    ('آفاق 17', 'آفاق 17'),
    ('آفاق 18', 'آفاق 18'),
    ('سعادت‌آباد', 'سعادت‌آباد'),
    ('قم', 'قم'),
]
ChoicesProclamationType = [
    ('اطلاعیه', 'اطلاعیه'),
    ('آیین‌نامه', 'آیین‌نامه'),
    ('ضوابط حراست', 'ضوابط حراست'),
    ('اخبار فضای مجازی', 'اخبار فضای مجازی'),
    ('محفل تخصصی', 'محفل تخصصی'),
    ('پینگ', 'پینگ'),
    ('درنگی نورانی', 'درنگی نورانی'),
    ('سرمایه انسانی', 'سرمایه انسانی'),
    ('فرانما', 'فرانما'),
    ('فناوری اطلاعات', 'فناوری اطلاعات'),
]
ChoicesProclamationDisplayDuration = [
    (7, 'یک هفته'),
    (15, 'دو هفته'),
    (30, 'یک ماه'),
]
ChoicesYearList = [
    (1400, 1400),
    (1401, 1401),
    (1402, 1402),
    (1403, 1403),
    (1404, 1404),
]
ChoicesMonthList = [
    (1, 'فروردین'),
    (2, 'اردیبهشت'),
    (3, 'خرداد'),
    (4, 'تیر'),
    (5, 'مرداد'),
    (6, 'شهریور'),
    (7, 'مهر'),
    (8, 'آبان'),
    (9, 'آذر'),
    (10, 'دی'),
    (11, 'بهمن'),
    (12, 'اسفند'),
]
ChoicesSessionColor = [
    ('teal-lighten-4', 'سبزآبی'),
    ('blue-lighten-4', 'آبی'),
    ('cyan-lighten-4', 'فیروزه‌ای'),
    ('green-lighten-4', 'سبز'),
    ('amber-lighten-4', 'نارنجی'),
    ('pink-lighten-5', 'صورتی'),
    ('purple-lighten-5', 'بنفش'),
    ('blue-grey-lighten-4', 'خاکستری'),
]
ChoicesJobStatus = [
    ('todo', 'درنوبت'),
    ('doing', 'جاری'),
    ('done', 'خاتمه'),
]
ChoicesJobUrgency = [
    (1, 1),
    (2, 2),
    (3, 3),
]
ChoicesFlowPatternType = [
    ('فناوری اطلاعات', 'فناوری اطلاعات'),
    ('مکاتبه با معاونت', 'مکاتبه با معاونت'),
    ('مالی و سرمایه‌های انسانی', 'مالی و سرمایه‌های انسانی'),
    ('پشتیبانی و تدارکات', 'پشتیبانی و تدارکات'),
    ('نظرسنجی و ارزیابی', 'نظرسنجی و ارزیابی'),
    ('روابط عمومی', 'روابط عمومی'),
    ('حراست', 'حراست'),
]
ChoicesWarehouseScale = [
    ('بسته', 'بسته'),
    ('کارتن', 'کارتن'),
    ('عدد', 'عدد'),
    ('دست', 'دست'),
    ('جفت', 'جفت'),
    ('کیلو', 'کیلو'),
    ('متر', 'متر'),
    ('باکس', 'باکس'),
    ('رول', 'رول'),
    ('لیتر', 'لیتر'),
]

# Flow module:

ChoiceFlowFiledType = [
    ('text', 'متن'),
    ('number', 'عدد'),
    ('currency', 'مبلغ'),
    ('radio', 'انتخاب - رادیویی'),
    ('select', 'انتخاب - کشویی'),
    ('autocomplete', 'انتخاب - قابل جستجو'),
    ('toggle', 'انتخاب - دکمه‌ای'),
    ('multi-select', 'چندانتخابی'),
    ('date', 'تاریخ'),
    ('datetime', 'زمان'),
    ('time', 'ساعت'),
    ('duration', 'مدت زمان'),
    ('file', 'فایل'),
    ('rich-text', 'متن چندخطی'),
    ('projects', 'لیست پروژه‌ها'),
    ('colleagues', 'لیست همکاران'),
]
ChoiceDispatchIfType = [
    ('خالی', 'خالی'),
    ('دارای مقدار', 'دارای مقدار'),
    ('مساوی', 'مساوی'),
    ('نامساوی', 'نامساوی'),
    ('بزرگتر', 'بزرگتر'),
    ('بزرگتر یا مساوی', 'بزرگتر یا مساوی'),
    ('کوچکتر', 'کوچکتر'),
    ('کوچکتر یا مساوی', 'کوچکتر یا مساوی'),
    ('موجود در لیست', 'موجود در لیست'),
    ('ناموجود در لیست', 'ناموجود در لیست'),
]

# Contract

ChoicesConfirmRejectModify = [
    ('نامشخص', 'نامشخص'),
    ('تأیید', 'تأیید'),
    ('عدم تأیید', 'عدم تأیید'),
    ('عودت جهت اصلاح', 'عودت جهت اصلاح'),
]

ChoicesContractInquiry = [
    ('نامشخص', 'نامشخص'),
    ('نیاز ندارد', 'نیاز ندارد'),
    ('درانتظار پاسخ استعلام', 'درانتظار پاسخ استعلام'),
    ('تأیید', 'تأیید'),
    ('عدم تأیید', 'عدم تأیید'),
]
RoomType = (
    ('chat', 'chat'),
    ('group', 'group'),
    ('channel', 'channel'),
)
ChoicesResponder = [
    ('مافوق', 'مافوق'),
    ('همتراز', 'همتراز'),
    ('تحت امر', 'تحت امر'),
    ('خودارزیابی', 'خودارزیابی'),
]
